//--------------------------------------------------------------------------------
//	精度管理ヘッダー
//　KF_Precision.h
//	Author : Xu Wenjie
//	Date   : 2016-07-24
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#ifndef _KF_PRECISION_H_
#define _KF_PRECISION_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include <float.h>
//--------------------------------------------------------------------------------
//  定数定義
//--------------------------------------------------------------------------------
#define DURATION (1.0f / 60.0f)
#define FLOAT_MAX FLT_MAX
#define FLOAT_MIN (0.1f)
#define GRAVITY (D3DXVECTOR3(0.0f,0.0f,0.0f))
#define DAMPING (0.95f)
#define RESTITUTION (0.3f)//回弾係数
#define ROTATION_DAMPING (0.4f)//回転係数
#define PX_PER_CM (3.904761904761904761f)
#define VEC3_NULL (D3DXVECTOR3(0.0f,0.0f,0.0f))

//car game 
#define NOS_MAX (100)
#define CAR_MASS (100.0f)
#define CAR_ROTATION_FORCE (D3DX_PI / 60 * 12000.0f)
#define CAR_ACC (40.0f)
#define CAR_NOS_ACC (40.0f)
#define CAR_WIDTH (67.0f)//ポリゴンの幅
#define CAR_HEIGHT (44.0f)//ポリゴンの高さ
#define TIRE_POS_WIDTH (CAR_WIDTH * 0.7f)
#define TIRE_POS_HEIGHT (CAR_HEIGHT * 0.7f)

//game area
#define GAME_AREA_LEFT (0.0f)
#define GAME_AREA_RIGHT (1280.0f)
#define GAME_AREA_TOP (307.0f)
#define GAME_AREA_BOTTOM (660.0f)
//--------------------------------------------------------------------------------
//  構造体定義
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  プロトタイプ宣言
//--------------------------------------------------------------------------------

#endif